import random

def get_numbers_ticket(min_num, max_num, quantity):
    #------------------------------------------------------------------------------
    # Перевірка коректності вхідних даних
    if not (1 <= min_num <= max_num <= 1000 and 1 <= quantity <= (max_num - min_num + 1)):
        return []
#----------------------------------------------------------------------------------
    # Генерування унікальних чисел за допомогою множини
    numbers = set() 
    while len(numbers) < quantity:
        numbers.add(random.randint(min_num, max_num))
#----------------------------------------------------------------------------------
    # Повернення відсортованого списку унікальних чисел
    return sorted(list(numbers)) 
#----------------------------------------------------------------------------------
#
#налаштування  
lottery_numbers = get_numbers_ticket (10, 100, 3) 
print("Ваші лотерейні числа:", lottery_numbers)